package com.qipilang.lvyouplatform.common;

public class SpinnerData {

	public static int provincePosition = 3;

	// 省级选项值
	public static String[] province = new String[] { "北京", "上海", "天津", "广东" };// ,"重庆","黑龙江","江苏","山东","浙江","香港","澳门"};
	// 地级选项值
	public static String[][] city = new String[][] {
			{ "东城区", "西城区", "崇文区", "宣武区", "朝阳区", "海淀区", "丰台区", "石景山区", "门头沟区",
					"房山区", "通州区", "顺义区", "大兴区", "昌平区", "平谷区", "怀柔区", "密云县",
					"延庆县" },
			{ "长宁区", "静安区", "普陀区", "闸北区", "虹口区" },
			{ "和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区",
					"东丽区" }, { "广州", "深圳", "韶关" // ,"珠海","汕头","佛山","湛江","肇庆","江门","茂名","惠州","梅州",
			// "汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"
			} };

	// 县级选项值
	public static String[][][] spot = new String[][][] { { // 北京
			{ "无" }, { "无" }, { "无" }, { "无" }, { "无" }, { "无" }, { "无" },
					{ "无" }, { "无" }, { "无" }, { "无" }, { "无" }, { "无" },
					{ "无" }, { "无" }, { "无" }, { "无" }, { "无" } }, { // 上海
			{ "无" }, { "无" }, { "无" }, { "无" }, { "无" } }, { // 天津
			{ "无" }, { "无" }, { "无" }, { "无" }, { "无" }, { "无" }, { "无" },
					{ "无" }, { "无" }, { "无" } }, { // 广东
					{ "海珠区", "荔湾区", "越秀区", "白云区", "萝岗区", "天河区", "黄埔区", "花都区",
							"从化市", "增城市", "番禺区", "南沙区" }, // 广州
					{ "宝安区", "福田区", "龙岗区", "罗湖区", "南山区", "盐田区" }, // 深圳
					{ "武江区", "浈江区", "曲江区", "乐昌市", "南雄市", "始兴县", "仁化县", "翁源县",
							"新丰县", "乳源县" } // 韶关
			} };
}
